import { useState } from 'react'
import Case from './components/Case'
import Like from './components/Like'
import Accordion from './components/Accordion'


function App() {
  const [count, setCount] = useState(0)

  return (
    <>
      <Case/>


      <Like/>

      <Accordion/>
    </>
  )
}

export default App






// 8) შექმენით Like კომპონენტი. დაარენდერეთ ეკრანზე:
// --> თეთრი გული, თუ არ არის დალაიკებული(initial State)
// --> წითელი/გაფერადებული გული, როცა გულზე დავაწკაპებთ.
// უნდა შეიძლებოდეს დალაიქება&ლაიიქის მოხსნა
// გამოიყენეთ გულის svg + tailwind





// 7) შექმენით CaseChanger კომპონენტი. ეკრანზე გამოაჩინეთ რაიმე გრძელი ტექსტი + ღილაკი.
// --> ღილაკზე დაჭერით თუ ტექსტი UPPERCASE არის უნდა და_lowercase_დეს და თუ lowercase არის უნდა და_UPPERCASE_დეს.




// 1) რა არის state React ში და რითი განსხვავდება იგი props გან?

// state არის მდგომარობა მისი დახმარებით შეგვიძლია რომ ავამოქმედოთ ჩვენი ვებსაიტი ანუ გავხადოთ statefull ,აქამდე ჩვენ ვერ ვარენდერებდით ხოლმე ელემენტებს მაგრამ სთეითის დახმარებით შეგვიძლია რენდერი მოვახხცდინოთ როგორც კონსოლში ასევე ვებსაიტზეც

// 2) რა არის useState? რატომ ვიყენებთ/ რა პრობლემას აგვარებს?

// use state არის ფუნქცია,რომელსაც ვიყენებთ იმისათვის რომ მოვახხდინოთ საირზე რენდერი და ჩვენი საიტი stateless იდან გადავიყვანოთ statefull ანუ შევძნოთ ფუნქციონალი რომლის რენდერსაც ვნახავთ ვებსაიტზეც

// 3)რას აბრუნებს useState ფუნქცია?

// useState აბრუნებს სიას,პირველი ელემენტი ამ სიაშ არის საწყისი მდგომარეობა და მეორე ელემენტი არის ფუნქცია

// 4) რატომ არ უნდა შევცვალოთ state პირდაპირ? (მაგ. count++)

// იმიტომ არუნდა შევცვალოთ რომ ასე ვერ დარენდერდება ჩვენი ელემენტი ხელახლა,როცა უსესტატე ში ვცვლით ელემენტის state-ს ანუ მდგომარეობას usestate დაარენდერებს ამ ელემენტს ხელახლა და თან ჩვენთვის სასსურველ მოქმედებას შეასრულებს

// 5) რა ემართება კომპონენტს, როცა state იცვლება?

// რხელახლა რენდერდება და იცვლება ჩვენთვის სასურველი მოქმედებით,მაგალითად თუ ქაუნთერს-- დავაჭერთ სთეითი შეიცვლება ამ ელემენტის თან დარენდერდება და ვნახავთ ამ ელემენტს შეცვლილს რომელიც შეიცვლებავთქვათ ამ ელემენტზე დაჭერის შედეგად