// მომხმარებელს შემოატანინეთ თვის სახელი მაგ:("იანვარი" , "თებერვალი") , თქვენი მიზანია დაადგინოთ მომხმარებლის შემოტანილი თვე სეზონის რომელი პერიოდია (ზაფხული,ზამთარი,შემოდგომა,თუ გაზაფხული)

let month = prompt("enter month:")

switch(month){
    case "მარტი":
    case "აპრილი":
    case "მაისი":
    case "ივნისი":
        console.log("გაზაფხული")
    case "ივლისი":
    case "აგვისტო":
    case "სექტემბერი":
    case "ოქტომბერი":
        console.log("ზაფხული")
    case "ნოემბერი":
    case "დეკემბერი":
    case "იანვარი":
    case "თებერვალი":
        console.log("ზაფხული")

}