# Sექმენით ერთი სია რომელშიც შეიტანთ სახელებს შემდეგ შექმენით მეორე სია რომელშიც იქნება ისევ სხვადასხვა სახელები გააერთიანეთ ეს ორი სია ჩაამატეთ 5 ინდექსზე ახალი სახელი დაითვალეთ გაერთიანებული სიის სიგრძე და დაითვალეთ თქვენი სახელი რამდენჯერ გვხვდება ამ სიაში, ასევე დაბეჭდეთ რომელ ინდექსზე დგას თქვენი სახელი 



name = ["giorgi","goga" , "irakli" , "goga", "ana", "salome"]

second = ["goga","beqa", "goga", "givi" ,"levani"]

#extend

name.extend(second)

print(name)

# ----------------------------------------

#insert

name.insert(5, "temuka")
print(name)

#------------------------------------------

#len

print(len(name))

#-------------------------------------------

#count

print(name.count("goga"))

#--------------------------------------------

print(name.index("goga"))