import { useState } from 'react'
import Card from './Card'
import Dog from './DogComponent'

function App() {


  return (
    <>
      <Card />
      <Dog/>
    </>

  )
}

export default App



// 1) ახსენით რა არის კომპონენტი React ში და რა უპირატესობა აქვს მას HTML ის ჩვეულებრივ კოდთან შედარებით. რატომ სჯობს კოდის დაყოფა მრავალ კომპონენტებად?

// Answer:კონპონენტი არის იგივე ბლოკი,სადაც ვწერთ კოდს და ამ კოდის ბლოკის გამოყენება შეგვიძლია მრავალგან,იმდენჯერ რამდენჯერაც დაგვჭირდება და აღარ გვიწევს კოდის კოპირება ან თავიდან დაწერა რომ ის შედეგი მივიღოთ ხელახლა რაც კონპონენტში უკვე გვაქვს
// =====================================
// 2) შექმენით Card კომპონენტი ან თქვენ რაც გინდათ,
//     ამ კომპონენტს უნდა ჰქონდეს სათაური, პარაგრაფი.
//     შექმენით რაიმე css ფაილი დააიმპორტეთ იგი თქვენს კომპონენტში და გასტილეთ

// 3) შექმენით <DogComponent /> კომპონენტი, რომელსაც ექნება სურათი, სათაური აღწერა და ღილაკი.
// გასტილეთ ეს კომპონენტი
// სურათი გადმოიწერეთ და შეინახეთ პროექტის ფოლდერში.
// დააიმპორტეთ სურათი კომპონენტში და დაარენდერეთ

// 4) შექმენით ზუსტად იგივე კომპონენტი როგორც <DogComponent />, ოღონდ <CatComponent />

// 5) შექმენით ზუსტად იგივე კომპონენტი როგორც <DogComponent />, ოღონდ <DragonComponent />

// 6) შექმენით რაიმე <AnimalsList /> კომპონენტი(ცოტა მაინც გააფორმეთ), რომელიც იქნება ერთგვარი ჩამონათვალი ცხოველებისა. <AnimalsInfo /> ში დააიმპორტეთ წინა დავალებაში შექმნილი ცხოველები და დაარენდერეთ ისინი. 