# კომენტარებით ახსენით რასაც გააკეთებთ ყველაფერი


#პირველ დავალებაში მომხმარებელს შემოაქვს ორი რიცხვი და ამ ორ რიცხვზე მოვახდინეთ  მათმატიკური ოპერაციები


#მეორე დავალებაში  შედარების ოპერატორებზე მოვიყვანეთ ათი მაგალითი 


#მესამე დავალებაში მომხმარებელმა შმოიტანა მისი სახელი გვარი და ასაკი რომლებიც დავბეჭდეთ ერთ მთელ წინადადებად


#მეოთე დავალებში ავხსენით მიმნიჭებელი ოპერატორის(=) და შედარების ოპერატორის(==) შორის განსხვავებები


#მეხუთ დავალებში მომხმარებელმა შმოიტანა თავისი სახელი გვარი და საცხოვრებელი ადგილი