# დაწერეთ ისეთი პროგრამა რომელიც მომხმარებელს უპრინტავს კვირის დღეს მომხმარებლის შემოტანილი რიცხვის მიხედვით (1 არის ორშაბათი, 2 სამშაბათი 
# და ა.შ) გამოიყენეთ if elif else 

print("1)ორშაბათი")

print("2)სამშაბათი")

print("3)ოთხშაბათი")

print("4)ხუთშაბათი")

print("5)პარასკევი")

print("6)შაბათი")

print("7)კვირა")



num = input("რომლის არჩვა გსურთ?:")

if num == "1":
    print("ეს არის ორშაბათი")
elif num == "2":
    print("ეს არის სამშაბათი")
elif num == "3":
    print("ეს არის ოთხშაბათი")
elif num == "4":
    print("ეს არის ხუთშაბათი")
elif num == "5":
    print("ეს არის პარასკევი")
elif num == "6":
    print("ეს არის შაბათი")
elif num == "7":
    print("ეს არის კვირა")
else:
    print("you inoput text is incorrect")
