// 1) შექმენით ფუნქცია, რომელიც მიიღებს n რაოდენობის რიცხვს და დაბეჭდავს მათ ჯამს.

// ფუნქციას გამოძახებისას უნდა გადასცეთ მინიმუმ 5 არგუმენტი. პირველი და მეორე არგუმენტები შეინახეთ ცვლადებში და დაბეჭდეთ მათი ნამრავლი, ხოლო სხვა დანარჩენი rest ოპერატორის გამოყენებით ჩასვით სიაში და დაბეჭდეთ მათი ჯამი


// function sum(one,two,...numbers){
//     console.log(one*two)
//     let sum = 0
//     for(let i of numbers){
//         sum+=i
//     }
//     console.log(sum)

// }
// sum(10,2,3,4,5,6)









// 2) შექმენით 3 სია, spread ოპერატორის გამოყენებით დაშალეთ თითოეული მათგანი და ჩასვით ახალ სიაში. ამ სიაში ასევე ჩაამატეთ 5 ნებისმიერი ელემენტი და დაბეჭდეთ.

let list1 = [1,2,3,4]

let list2 = [5,6,7,8]

let list3 = [9,10,11,12]

let all = [...list1,...list2,...list3,13,14,15,16,17]

console.log(all)
